# RbsElecNumberOfPoles Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecNumberOfPoles Property
ParameterTypeId Class See Also
---
"Number of Poles"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecNumberOfPoles { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecNumberOfPoles As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecNumberOfPoles {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace